app/views/users/show.html.erb

      <%= @user.name %>
      <%= Departament.find(@user.departament_id).name %>
      <%= Role.find(@user.role_id).name %>
      <%= Charge.find(@user.charge_id).name %>
      <%= Area.find(@user.area_id).name %>
---
SELECT  "departaments".* FROM "departaments" WHERE "departaments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "charges".* FROM "charges" WHERE "charges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]