app/controllers/evaluated_controller.rb

  def step_one
    @bosses = User.where(departament: current_user.departament)
---
SELECT  "departaments".* FROM "departaments" WHERE "departaments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."departament_id" = 2