app/controllers/goals_controller.rb

  def create
    @goal = Goal.new(goal_params)
    if @goal.save
---
INSERT INTO "goals" ("perspective", "description", "generalIndicator", "specificIndicator", "formula", "weight", "typeGoal", "measure", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)