app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_hash", "password_salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "boss" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["boss", 14], ["updated_at", "2017-11-11 12:45:32.472164"], ["id", 1]]
---
  def update
    if @user.update(user_params)